Revit 2024 API
TabbedDialogExtension Properties
The TabbedDialogExtension type exposes the following members.
Properties
Name | Description
Control
The control.
OnCancelAction
The cancel handler.
OnOKAction
The ok handler.
OnRestoreDefaultsAction
The restore defaults handler.
See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace